Autodesk.Revit.DB.BuiltInFailures.ParameterFailures.InconsistentSharedParameterDefinitions
The shared parameter '...' cannot be added with name '...' and type '...' because it conflicts with the existing name '...' and type '...'.

Autodesk.Revit.DB.BuiltInFailures.ParameterFailures
Failures related to parameters and parameter operations.